Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.1.98/atdf/PIC32MZ2025DAS176.atdf
         <register caption="" name="GLCDCLUT148" offset="0x650" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT149" offset="0x654" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT150" offset="0x658" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT151" offset="0x65C" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT152" offset="0x660" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT153" offset="0x664" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT154" offset="0x668" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT155" offset="0x66C" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT156" offset="0x670" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT157" offset="0x674" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT158" offset="0x678" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT159" offset="0x67C" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT160" offset="0x680" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT161" offset="0x684" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT162" offset="0x688" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT163" offset="0x68C" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT164" offset="0x690" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT165" offset="0x694" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT166" offset="0x698" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT167" offset="0x69C" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT168" offset="0x6A0" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT169" offset="0x6A4" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT170" offset="0x6A8" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT171" offset="0x6AC" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT172" offset="0x6B0" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT173" offset="0x6B4" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT174" offset="0x6B8" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT175" offset="0x6BC" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT176" offset="0x6C0" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT177" offset="0x6C4" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT178" offset="0x6C8" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT179" offset="0x6CC" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT180" offset="0x6D0" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT181" offset="0x6D4" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
